using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Dentistry
{
    class Enums
    {              
        public enum DateFlag
        {
            تاریخ_پذیرش = 1,
            تاریخ_ترخیص = 2,
            تاریخ_سرویس = 3
        }

        public enum AppActions
        {
            تنظیمات_مشاهده = 1,
            تنظیمات_اطلاعات_مطب_ثبت_اطلاعات_مطب = 2,
            تنظیمات_کاربران_و_سطح_دسترسی_جدبد = 3,
            تنظیمات_کاربران_و_سطح_دسترسی_ویرایش = 4,
            تنظیمات_کاربران_و_سطح_دسترسی_حذف = 5,
            تنظیمات_کارمندان_جدید = 6,
            تنظیمات_کارمندان_ویرایش = 7,
            تنظیمات_کارمندان_حذف = 8,
            تنظیمات_خدمات_مطب_جدبد = 9,
            تنظیمات_خدمات_مطب_ویرایش = 10,           
            تنظیمات_خدمات_مطب_حذف = 11,
            تنظیمات_خدمات_مطب_تعرفه_گذاری_خدمات = 12,
            تنظیمات_بیمه_گرها_جدبد = 13,
            تنظیمات_بیمه_گرها_ویرایش = 14,
            تنظیمات_بیمه_گرها_حذف = 15,
            تنظیمات_تعیین_زمان_بازه_کار_مطب_ایجاد_برشهای_زمانی_جدید = 16,
            تنظیمات_تنظیمات_مریوط_به_اس_ام_اس_ثبت_تنظیمات_مریوط_به_اس_ام_اس = 17,
            تنظیمات_کدینگ_پایه_جدبد = 18,
            تنظیمات_کدینگ_پایه_ویرایش = 19,
            تنظیمات_کدینگ_پایه_حذف = 20,
            نوبت_دهی_مشاهده = 21,
            نوبت_دهی__ثبت_نوبت_دهی_بیماران = 22,
            بیماران_مشاهده = 23,
            بیماران_مشاهده_پرونده_عمومی_بیمار = 24,
            بیماران_جدبد = 25,
            بیماران_ویرایش = 26,
            بیماران_حذف = 27,
            پرونده_عمومی_بیمار_مشاهده = 28,
            پرونده_عمومی_بیمار_مشاهده_فرم_برائت_بیمار = 29,
            پرونده_عمومی_بیمار_مشاهده_فرم_فالوآپ_بیمار = 30,
            پرونده_عمومی_بیمار__درمان_های_انجام_شده_بیمار_جدید = 31,
            پرونده_عمومی_بیمار__درمان_های_انجام_شده_بیمار_ویرایش = 32,
            پرونده_عمومی_بیمار__درمان_های_انجام_شده_بیمار_حذف = 33,
            پرونده_عمومی_بیمار_تراکنش_های_مالی_بیمار_جدید = 34,
            پرونده_عمومی_بیمار_تراکنش_های_مالی_بیمار_ویرایش = 35,
            پرونده_عمومی_بیمار_تراکنش_های_مالی_بیمار_حذف = 36,
            پرونده_عمومی_بیمار_اسناد_پزشکی_بیمار_جدید = 37,
            پرونده_عمومی_بیمار_اسناد_پزشکی_بیمار_ویرایش = 38,
            پرونده_عمومی_بیمار_اسناد_پزشکی_بیمار_حذف = 39,
            پرونده_عمومی_بیمار_ملاحضات_ویژه_جدید = 40,
            پرونده_عمومی_بیمار_ملاحضات_ویژه_ویرایش = 41,
            پرونده_عمومی_بیمار_ملاحضات_ویژه_حذف = 42,
            پرونده_عمومی_بیمار_بیماریهای_خاص_انتخاب_و_حذف_بیماری = 43,
            پرونده_عمومی_بیمار_داروهای_خاص_انتخاب_و_حذف_دارو = 44,
            مدیریت_خدمات__مشاهده = 45,
            مدیریت_تراکنش_ها_مشاهده = 46,
            مدیریت_تراکنش_ها_جدید = 47,
            مدیریت_تراکنش_ها_ویرایش = 48,
            مدیریت_تراکنش_ها_حذف = 49,
            مدیریت_هزینه_ها_مشاهده = 50,
            مدیریت_هزینه_ها_جدید = 51,
            مدیریت_هزینه_ها_ویرایش = 52,
            مدیریت_هزینه_ها_حذف = 53,
            مدیریت_بیمه_ها_مشاهده = 54,
            مدیریت_بیمه_ها_جدید = 55,
            مدیریت_بیمه_ها_ویرایش = 56,
            مدیریت_بیمه_ها_حذف = 57,
            مدیریت_چک_ها_مشاهده = 58,
            مدیریت_چک_ها_جدید = 59,
            مدیریت_چک_ها_ویرایش = 60,
            مدیریت_چک_ها_حذف = 61,
            گزارشات_مشاهده = 62,
        }
    }
}
